# Процентная ставка по вкладу составляет P процентов годовых,
# которые прибавляются к сумме вклада. Вклад составляет X рублей Y копеек.
# Определите размер вклада через год. При решении этой задачи нельзя пользоваться условными инструкциями и циклами.
# вывод ответа двумя int: рубли, копейки
p = int(input())
x = int(input())
y = int(input())
rv = (x + y * 0.01) * (1 + (p * 0.01))
print(int(rv // 1), int((rv * 100) % 100))
