# найти любое ближайшее (раз любое, тогда abs применим)
a = int(input())                     # количество чисел
n = list(map(int, input().split()))  # числа
x = int(input())                     # для кого ищем ближайшее
delta = [0] * a                      # создаем список дельт каждого числа относительно 'x'
for i in range(a):
    delta[i] = abs(x - n[i])
print(n[delta.index(min(delta))])    # берём минимальное значение в дельте, его индекс совпадает с искомым в 'n'

# потестить:

# 8
# -16 -24 -1 0 1 9 15 16
# -20
# [-4, -5, -19, -20, -21, -29, -35, -36]

# 8
# -16 -15 -1 0 1 9 15 16
# 20
# [36, 35, 21, 20, 19, 11, 5, 4]
