# Процентная ставка по вкладу составляет P процентов годовых,
# которые прибавляются к сумме вклада через год. Вклад составляет
# X рублей Y копеек. Определите размер вклада через K лет.
# Программа должна вывести два числа: величину вклада через K лет
# в рублях и копейках. Дробное число копеек по истечение года отбрасывается.
# Перерасчет суммы вклада (с отбрасыванием дробных частей копеек) происходит ежегодно.
p = int(input())
x = int(input())
y = int(input())
k = int(input())
deposit = x * 100 + y
annual = deposit * p / 100
while k:
    deposit += annual
    deposit //= 1
    annual = deposit * p / 100
    k -= 1
print(int(deposit / 100 // 1), int(deposit % 100))
