# Сколько различных чисел встречается в списке. Функциональный стиль курсеры.
print(
    len(
        set(
            map(
                int,
                input().split()
            )
        )
    )
)
