n = int(input())             # количество школьников
languages = set()            # список всех языков
arr = []                     # список языков по школьникам
for i in range(n):           # для каждого школьника
    arr.append(set())        # создаём set
    m = int(input())         # количество языков
    for j in range(m):       # для каждого языка
        lang = input()       # название языка
        arr[i].add(lang)     # добавляем язык в сет данного школьника
        languages.add(lang)  # добавляем язык в сет всех языков

ek = list(arr[0].intersection(*arr[1:]))  # языки, которые знают все школьники
print(len(ek), *sorted(ek), len(languages), *sorted(languages), sep='\n')
# Количество языков, которые знают все школьники, список таких языков.
# Количество языков, которые знает хотя бы один школьник, список таких языков.
