# Найдите в этой строке второе вхождение буквы f и выведите индекс этого вхождения.
# Если буква f в данной строке встречается только один раз, выведите число -1,
# а если не встречается ни разу, выведите число -2
s = input()
pos1 = s.find('f')
pos2 = s[pos1+1:].find('f') + pos1 + 1 if s[pos1+1:].find('f') != -1 else 0
if pos2:
    print(pos2)
else:
    if pos1 == -1:
        print(-2)
    else:
        print(-1)
