# Определить тип треугольника по трём сторонам.
# Прямоугольный, тупоугольный, остроугольный или же такой треугольник невозможен?
# Допускаются только операции сравнения и условные операторы.
a, b, c = int(input()), int(input()), int(input())
if b <= a >= c:                     # Выбираем наибольшую сторону(a).
    if b + c > a > b - c:           # Исходя из теоремы Пифагора, проверяем, если:
        if c**2 + b**2 == a**2:     # квадрат наибольшей стороны равен сумме квадратов 2-х других - прямоугольный
            print('rectangular')
        elif a**2 > (b**2 + c**2):  # квадрат наибольшей стороны больше суммы квадратов 2-х других - тупоугольный
            print('obtuse')
        elif a**2 < (b**2 + c**2):  # квадрат наибольшей стороны меньше суммы квадратов 2-х других - остроугольный
            print('acute')
    else:
        print('impossible')         # в остальных случаях - невозможный
elif a <= b >= c:
    if a + c > b > a - c:           # Выбираем наибольшую сторону(Y).
        if c**2 + a**2 == b**2:
            print('rectangular')
        elif b**2 > a**2 + c**2:
            print('obtuse')
        elif b**2 < a**2 + c**2:
            print('acute')
    else:
        print('impossible')
else:
    if a + b > c > a - b:           # Выбираем наибольшую сторону(Z).
        if a**2 + b**2 == c**2:
            print('rectangular')
        elif c**2 > a**2 + b**2:
            print('obtuse')
        elif c**2 < a**2 + b**2:
            print('acute')
    else:
        print('impossible')
